Revit 2026 API

# ExternalServiceGetPublicAccessKey Method

---

Access key to use to execute a service.

**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Guid GetPublicAccessKey()
```
```vb
Public Function GetPublicAccessKey As Guid
```
```cpp
public:
Guid GetPublicAccessKey()
```
```fsharp
member GetPublicAccessKey : unit -> Guid
```

#### Return Value

Guid GUID representing the access key.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The service is not public, thus the access key cannot be obtained. |

The service must be declared as public in order for callers be able to invoke this method. Services that are not public can be executed only by their owners (the ones who registered it).

Most services are not public and may only be executed by their respective owners. To see whether a service was declared as public, call the GetOptions method and check the IsPublic property.

#### Reference

ExternalService Class

Autodesk.Revit.DB.ExternalService Namespace